RESULTS/PERFCNTR/sqlite_nodatapersist_enablelog_HWCNTR_all.out
Enter application name and arguments as params for the script
Keys:       16 bytes each
Values:     100 bytes each
Entries:    300000
RawSize:    33.2 MB (estimated)
------------------------------------------------
fillseq      :       7.500 micros/op;   14.7 MB/s
fillseqsync  :       7.289 micros/op;   15.2 MB/s (3000 ops)
fillseqbatch :       4.586 micros/op;   24.1 MB/s
fillrandom   :       9.631 micros/op;   11.5 MB/s
fillrandsync :       8.205 micros/op;   13.5 MB/s (3000 ops)
fillrandbatch :       7.609 micros/op;   14.5 MB/s
overwrite    :      11.330 micros/op;    9.8 MB/s
overwritebatch :      10.524 micros/op;   10.5 MB/s
readrandom   :       4.370 micros/op;
readseq      :       1.544 micros/op;   61.8 MB/s
fillrand100K :     127.273 micros/op;  749.4 MB/s (300 ops)
fillseq100K  :      92.030 micros/op; 1036.4 MB/s (300 ops)
readseq      :      17.713 micros/op; 5384.1 MB/s
readrand100K :      19.724 micros/op;
             :       0.954 micros/op;
-------------------------------------------------------------
-------------------------------------------------------------
CPU type:	Intel Core Haswell processor 
CPU clock:	3.39 GHz 
-------------------------------------------------------------
/home/sudarsun/libs/linux-examples/leveldb-1.14.0/db_bench_mem_sqlite3_wal_memjournal
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+--------+--------+-------------+
|                   Event                   |   core 0    |   core 1    |   core 2    |   core 3    | core 4 | core 5 | core 6 |   core 7    |
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+--------+--------+-------------+
|             INSTR_RETIRED_ANY             | 9.94409e+10 | 2.15327e+09 | 7.87123e+07 | 5.73424e+08 |   0    | 134499 |   0    | 7.74706e+06 |
| MEM_LOAD_UOPS_LLC_MISS_RETIRED_LOCAL_DRAM | 2.66114e+07 | 2.16182e+06 |    23367    | 1.28062e+06 |   0    |  866   |   0    |    6601     |
|           MEM_UOP_RETIRED_LOADS           | 4.04953e+10 | 6.86469e+08 | 2.36718e+07 | 1.73815e+08 |   0    | 36627  |   0    | 2.05384e+06 |
|          MEM_UOP_RETIRED_STORES           | 1.82158e+10 | 2.49323e+08 | 1.95144e+07 | 1.45286e+08 |   0    | 21707  |   0    | 1.07422e+06 |
|             INSTR_RETIRED_ANY             | 9.94409e+10 | 2.15327e+09 | 7.87123e+07 | 5.73424e+08 |   0    | 134499 |   0    | 7.74706e+06 |
|           CPU_CLK_UNHALTED_CORE           | 6.6091e+10  | 1.01085e+09 | 1.21501e+08 | 9.66931e+08 |   0    | 476868 |   0    | 1.19445e+07 |
|           CPU_CLK_UNHALTED_REF            | 5.76801e+10 | 8.88023e+08 | 1.08793e+08 | 8.43907e+08 |   0    | 428060 |   0    | 1.05887e+07 |
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+--------+--------+-------------+
+------------------------------------------------+-------------+-------------+-----+-------------+
|                     Event                      |     Sum     |     Max     | Min |     Avg     |
+------------------------------------------------+-------------+-------------+-----+-------------+
|             INSTR_RETIRED_ANY STAT             | 1.02254e+11 | 9.94409e+10 |  0  | 1.27818e+10 |
| MEM_LOAD_UOPS_LLC_MISS_RETIRED_LOCAL_DRAM STAT | 3.00847e+07 | 2.66114e+07 |  0  | 3.76059e+06 |
|           MEM_UOP_RETIRED_LOADS STAT           | 4.13813e+10 | 4.04953e+10 |  0  | 5.17267e+09 |
|          MEM_UOP_RETIRED_STORES STAT           | 1.8631e+10  | 1.82158e+10 |  0  | 2.32888e+09 |
|             INSTR_RETIRED_ANY STAT             | 1.02254e+11 | 9.94409e+10 |  0  | 1.27818e+10 |
|           CPU_CLK_UNHALTED_CORE STAT           | 6.82027e+10 | 6.6091e+10  |  0  | 8.52534e+09 |
|           CPU_CLK_UNHALTED_REF STAT            | 5.95318e+10 | 5.76801e+10 |  0  | 7.44148e+09 |
+------------------------------------------------+-------------+-------------+-----+-------------+
+----------------------+----------+----------+-----------+---------+--------+------------+--------+------------+
|        Metric        |  core 0  |  core 1  |  core 2   | core 3  | core 4 |   core 5   | core 6 |   core 7   |
+----------------------+----------+----------+-----------+---------+--------+------------+--------+------------+
| Runtime (RDTSC) [s]  |  17.286  |  17.286  |  17.286   | 17.286  | 17.286 |   17.286   | 17.286 |   17.286   |
| Runtime unhalted [s] | 19.4836  | 0.297999 | 0.0358184 | 0.28505 |   0    | 0.00014058 |   0    | 0.00352122 |
|     Clock [MHz]      | 3886.78  | 3861.34  |  3788.38  | 3886.65 |   0    |  3778.92   |   0    |  3826.46   |
|         CPI          | 0.664626 | 0.46945  |  1.54361  | 1.68624 |   0    |  3.54551   |   0    |  1.54181   |
+----------------------+----------+----------+-----------+---------+--------+------------+--------+------------+
Enter application name and arguments as params for the script
Keys:       16 bytes each
Values:     100 bytes each
Entries:    300000
RawSize:    33.2 MB (estimated)
------------------------------------------------
fillseq      :       7.492 micros/op;   14.8 MB/s
fillseqsync  :       7.322 micros/op;   15.1 MB/s (3000 ops)
fillseqbatch :       4.671 micros/op;   23.7 MB/s
fillrandom   :       9.707 micros/op;   11.4 MB/s
fillrandsync :       8.216 micros/op;   13.5 MB/s (3000 ops)
fillrandbatch :       7.641 micros/op;   14.5 MB/s
overwrite    :      11.456 micros/op;    9.7 MB/s
overwritebatch :      10.589 micros/op;   10.4 MB/s
readrandom   :       4.365 micros/op;
readseq      :       1.541 micros/op;   61.9 MB/s
fillrand100K :     127.374 micros/op;  748.8 MB/s (300 ops)
fillseq100K  :      92.127 micros/op; 1035.3 MB/s (300 ops)
readseq      :      17.323 micros/op; 5505.3 MB/s
readrand100K :      19.953 micros/op;
             :       0.000 micros/op;
-------------------------------------------------------------
-------------------------------------------------------------
CPU type:	Intel Core Haswell processor 
CPU clock:	3.39 GHz 
-------------------------------------------------------------
/home/sudarsun/libs/linux-examples/leveldb-1.14.0/db_bench_mem_sqlite3_wal_memjournal
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+--------+--------+--------+
|                   Event                   |   core 0    |   core 1    |   core 2    |   core 3    | core 4 | core 5 | core 6 | core 7 |
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+--------+--------+--------+
|             INSTR_RETIRED_ANY             | 9.94396e+10 | 2.22716e+09 | 5.96887e+06 | 6.52244e+08 |   0    |   0    |   0    | 21264  |
| MEM_LOAD_UOPS_LLC_MISS_RETIRED_LOCAL_DRAM | 2.67155e+07 | 2.04607e+06 |    18438    | 1.66288e+06 |   0    |   0    |   0    |  537   |
|           MEM_UOP_RETIRED_LOADS           | 4.04949e+10 | 7.14139e+08 | 2.09409e+06 | 1.98633e+08 |   0    |   0    |   0    |  6143  |
|          MEM_UOP_RETIRED_STORES           | 1.82155e+10 | 2.52659e+08 |   530139    | 1.67271e+08 |   0    |   0    |   0    |  3513  |
|             INSTR_RETIRED_ANY             | 9.94396e+10 | 2.22716e+09 | 5.96887e+06 | 6.52244e+08 |   0    |   0    |   0    | 21264  |
|           CPU_CLK_UNHALTED_CORE           | 6.65186e+10 | 1.01198e+09 | 3.93082e+06 | 1.10376e+09 |   0    |   0    |   0    | 197559 |
|           CPU_CLK_UNHALTED_REF            | 5.80755e+10 | 8.89665e+08 | 3.44508e+06 | 9.64122e+08 |   0    |   0    |   0    | 172278 |
+-------------------------------------------+-------------+-------------+-------------+-------------+--------+--------+--------+--------+
+------------------------------------------------+-------------+-------------+-----+-------------+
|                     Event                      |     Sum     |     Max     | Min |     Avg     |
+------------------------------------------------+-------------+-------------+-----+-------------+
|             INSTR_RETIRED_ANY STAT             | 1.02325e+11 | 9.94396e+10 |  0  | 1.27906e+10 |
| MEM_LOAD_UOPS_LLC_MISS_RETIRED_LOCAL_DRAM STAT | 3.04434e+07 | 2.67155e+07 |  0  | 3.80543e+06 |
|           MEM_UOP_RETIRED_LOADS STAT           | 4.14098e+10 | 4.04949e+10 |  0  | 5.17622e+09 |
|          MEM_UOP_RETIRED_STORES STAT           | 1.86359e+10 | 1.82155e+10 |  0  | 2.32949e+09 |
|             INSTR_RETIRED_ANY STAT             | 1.02325e+11 | 9.94396e+10 |  0  | 1.27906e+10 |
|           CPU_CLK_UNHALTED_CORE STAT           | 6.86384e+10 | 6.65186e+10 |  0  | 8.5798e+09  |
|           CPU_CLK_UNHALTED_REF STAT            | 5.99329e+10 | 5.80755e+10 |  0  | 7.49161e+09 |
+------------------------------------------------+-------------+-------------+-----+-------------+
+----------------------+----------+----------+------------+----------+---------+---------+---------+------------+
|        Metric        |  core 0  |  core 1  |   core 2   |  core 3  | core 4  | core 5  | core 6  |   core 7   |
+----------------------+----------+----------+------------+----------+---------+---------+---------+------------+
| Runtime (RDTSC) [s]  | 17.3661  | 17.3661  |  17.3661   | 17.3661  | 17.3661 | 17.3661 | 17.3661 |  17.3661   |
| Runtime unhalted [s] | 19.6105  | 0.298345 | 0.00115886 | 0.325404 |    0    |    0    |    0    | 5.8243e-05 |
|     Clock [MHz]      | 3885.11  | 3858.33  |  3870.23   | 3883.27  |    0    |    0    |    0    |  3889.74   |
|         CPI          | 0.668934 | 0.454382 |  0.658553  | 1.69226  |    0    |    0    |    0    |  9.29077   |
+----------------------+----------+----------+------------+----------+---------+---------+---------+------------+